results/up_to_10000/wrk_reactor_up_to_10000.txt
Server type: reactor

Running 10s test @ http://localhost:12345/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    77.89us   73.55us   4.93ms   99.44%
    Req/Sec    12.99k   501.17    15.53k    80.20%
  Latency Distribution
     50%   71.00us
     75%   87.00us
     90%  105.00us
     99%  139.00us
  130547 requests in 10.10s, 387.57MB read
Requests/sec:  12925.68
Transfer/sec:     38.37MB

Running 10s test @ http://localhost:12345/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    72.34us   47.76us   3.68ms   97.81%
    Req/Sec    13.81k   784.47    19.29k    91.09%
  Latency Distribution
     50%   68.00us
     75%   82.00us
     90%  100.00us
     99%  130.00us
  138794 requests in 10.10s, 412.05MB read
Requests/sec:  13740.62
Transfer/sec:     40.79MB

Running 10s test @ http://localhost:12345/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    75.59us   58.08us   4.33ms   98.79%
    Req/Sec    13.28k   676.25    16.37k    85.15%
  Latency Distribution
     50%   70.00us
     75%   85.00us
     90%  104.00us
     99%  137.00us
  133435 requests in 10.10s, 396.14MB read
Requests/sec:  13212.02
Transfer/sec:     39.22MB

Running 10s test @ http://localhost:12345/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.95us   67.77us   4.78ms   99.29%
    Req/Sec    13.67k     1.13k   20.15k    90.10%
  Latency Distribution
     50%   69.00us
     75%   83.00us
     90%  102.00us
     99%  135.00us
  137475 requests in 10.10s, 408.13MB read
Requests/sec:  13612.27
Transfer/sec:     40.41MB

Running 10s test @ http://localhost:12345/
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    74.05us   57.24us   4.04ms   99.01%
    Req/Sec    13.58k   481.25    15.62k    78.22%
  Latency Distribution
     50%   69.00us
     75%   83.00us
     90%  101.00us
     99%  131.00us
  136443 requests in 10.10s, 405.07MB read
Requests/sec:  13509.10
Transfer/sec:     40.11MB

Running 10s test @ http://localhost:12345/
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   127.94us   56.02us   4.16ms   95.23%
    Req/Sec     7.74k   380.21     8.52k    67.08%
  Latency Distribution
     50%  123.00us
     75%  143.00us
     90%  165.00us
     99%  214.00us
  622719 requests in 10.10s, 1.81GB read
Requests/sec:  61654.21
Transfer/sec:    183.04MB

Running 10s test @ http://localhost:12345/
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   132.39us  190.45us  10.75ms   99.73%
    Req/Sec     7.76k   362.40     8.66k    66.71%
  Latency Distribution
     50%  123.00us
     75%  143.00us
     90%  164.00us
     99%  213.00us
  623692 requests in 10.10s, 1.81GB read
Requests/sec:  61756.03
Transfer/sec:    183.34MB

Running 10s test @ http://localhost:12345/
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   124.89us   54.40us   4.09ms   95.75%
    Req/Sec     7.94k   330.09     8.64k    75.25%
  Latency Distribution
     50%  120.00us
     75%  140.00us
     90%  160.00us
     99%  205.00us
  638342 requests in 10.10s, 1.85GB read
Requests/sec:  63203.35
Transfer/sec:    187.64MB

Running 10s test @ http://localhost:12345/
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   130.12us  179.24us  10.33ms   99.72%
    Req/Sec     7.88k   363.00     8.51k    79.46%
  Latency Distribution
     50%  121.00us
     75%  141.00us
     90%  161.00us
     99%  211.00us
  633630 requests in 10.10s, 1.84GB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:  62739.38
Transfer/sec:    186.26MB

Running 10s test @ http://localhost:12345/
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   135.83us  166.35us   9.36ms   99.33%
    Req/Sec     7.63k   636.59     8.54k    87.75%
  Latency Distribution
     50%  124.00us
     75%  145.00us
     90%  168.00us
     99%  241.00us
  613620 requests in 10.10s, 1.78GB read
Requests/sec:  60757.08
Transfer/sec:    180.37MB

Running 10s test @ http://localhost:12345/
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   155.95us  310.41us  13.21ms   99.12%
    Req/Sec     7.11k   817.01     8.28k    85.61%
  570255 requests in 10.10s, 1.65GB read
Requests/sec:  56466.21
Transfer/sec:    167.64MB

Running 10s test @ http://localhost:12345/
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   668.07us   95.14us   5.62ms   89.28%
    Req/Sec     8.90k   212.90     9.41k    73.02%
  Latency Distribution
     50%  664.00us
     75%  702.00us
     90%  740.00us
     99%  833.00us
  715839 requests in 10.10s, 2.08GB read
Requests/sec:  70873.78
Transfer/sec:    210.41MB

Running 10s test @ http://localhost:12345/
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   666.29us  112.14us   6.59ms   92.07%
    Req/Sec     8.93k   369.59    12.41k    85.48%
  Latency Distribution
     50%  662.00us
     75%  701.00us
     90%  742.00us
     99%  844.00us
  716022 requests in 10.10s, 2.08GB read
Requests/sec:  70886.14
Transfer/sec:    210.45MB

Running 10s test @ http://localhost:12345/
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   666.36us   98.07us   5.67ms   89.49%
    Req/Sec     8.93k   266.86     9.57k    70.30%
  Latency Distribution
     50%  662.00us
     75%  701.00us
     90%  740.00us
     99%  840.00us
  717628 requests in 10.10s, 2.08GB read
Requests/sec:  71047.09
Transfer/sec:    210.92MB

Running 10s test @ http://localhost:12345/
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   659.59us  110.51us   6.69ms   94.19%
    Req/Sec     9.03k   462.21    14.49k    97.27%
  Latency Distribution
     50%  657.00us
     75%  693.00us
     90%  727.00us
     99%  806.00us
  723457 requests in 10.10s, 2.10GB read
Requests/sec:  71630.33
Transfer/sec:    212.66MB

Running 10s test @ http://localhost:12345/
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   661.72us   90.21us   5.68ms   89.96%
    Req/Sec     9.00k   176.10     9.59k    76.61%
  Latency Distribution
     50%  659.00us
     75%  694.00us
     90%  729.00us
     99%  803.00us
  723321 requests in 10.10s, 2.10GB read
Requests/sec:  71617.71
Transfer/sec:    212.62MB

Running 10s test @ http://localhost:12345/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms  171.08us  15.26ms   94.10%
    Req/Sec     9.01k   242.83     9.64k    69.55%
  Latency Distribution
     50%    1.32ms
     75%    1.38ms
     90%    1.43ms
     99%    1.59ms
  724541 requests in 10.10s, 2.10GB read
Requests/sec:  71727.91
Transfer/sec:    212.94MB

Running 10s test @ http://localhost:12345/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms  152.04us   9.66ms   90.87%
    Req/Sec     9.03k   243.91     9.73k    76.24%
  Latency Distribution
     50%    1.32ms
     75%    1.38ms
     90%    1.43ms
     99%    1.61ms
  725526 requests in 10.10s, 2.10GB read
Requests/sec:  71816.12
Transfer/sec:    213.21MB

Running 10s test @ http://localhost:12345/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  172.39us  16.44ms   95.12%
    Req/Sec     9.11k   205.57     9.66k    75.25%
  Latency Distribution
     50%    1.31ms
     75%    1.36ms
     90%    1.42ms
     99%    1.55ms
  732594 requests in 10.10s, 2.12GB read
Requests/sec:  72504.56
Transfer/sec:    215.25MB

Running 10s test @ http://localhost:12345/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms  259.76us  12.31ms   98.74%
    Req/Sec     9.05k   240.41     9.62k    74.63%
  Latency Distribution
     50%    1.32ms
     75%    1.37ms
     90%    1.42ms
     99%    1.57ms
  727348 requests in 10.10s, 2.11GB read
Requests/sec:  72007.57
Transfer/sec:    213.78MB

Running 10s test @ http://localhost:12345/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  215.23us  15.94ms   97.25%
    Req/Sec     9.28k   346.09     9.74k    75.87%
  Latency Distribution
     50%    1.27ms
     75%    1.33ms
     90%    1.39ms
     99%    1.56ms
  746374 requests in 10.10s, 2.16GB read
Requests/sec:  73879.01
Transfer/sec:    219.33MB

Running 10s test @ http://localhost:12345/
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.71ms  304.80us  22.08ms   95.07%
    Req/Sec     9.23k   339.58    12.18k    86.48%
  Latency Distribution
     50%    2.71ms
     75%    2.80ms
     90%    2.89ms
     99%    3.15ms
  740101 requests in 10.10s, 2.15GB read
Requests/sec:  73253.28
Transfer/sec:    217.47MB

Running 10s test @ http://localhost:12345/
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.74ms  331.24us  23.08ms   94.30%
    Req/Sec     9.14k   390.89    12.17k    80.15%
  Latency Distribution
     50%    2.73ms
     75%    2.83ms
     90%    2.94ms
     99%    3.28ms
  732621 requests in 10.10s, 2.12GB read
Requests/sec:  72512.92
Transfer/sec:    215.28MB

Running 10s test @ http://localhost:12345/
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.75ms  393.96us  27.32ms   96.23%
    Req/Sec     9.12k   366.66    12.14k    83.25%
  Latency Distribution
     50%    2.74ms
     75%    2.84ms
     90%    2.94ms
     99%    3.30ms
  731145 requests in 10.10s, 2.12GB read
Requests/sec:  72364.18
Transfer/sec:    214.83MB

Running 10s test @ http://localhost:12345/
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    0.95ms  68.50ms   99.33%
    Req/Sec     9.10k   275.39     9.74k    82.62%
  Latency Distribution
     50%    2.74ms
     75%    2.83ms
     90%    2.92ms
     99%    3.35ms
  724488 requests in 10.00s, 2.10GB read
Requests/sec:  72414.44
Transfer/sec:    214.98MB

Running 10s test @ http://localhost:12345/
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.75ms  414.56us  27.87ms   97.89%
    Req/Sec     9.12k   254.00     9.85k    71.53%
  Latency Distribution
     50%    2.73ms
     75%    2.83ms
     90%    2.93ms
     99%    3.24ms
  733402 requests in 10.11s, 2.13GB read
Requests/sec:  72574.04
Transfer/sec:    215.46MB

Running 10s test @ http://localhost:12345/
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.05ms  677.79us  35.75ms   97.63%
    Req/Sec     9.17k     0.92k   23.84k    99.25%
  Latency Distribution
     50%    4.05ms
     75%    4.17ms
     90%    4.29ms
     99%    4.70ms
  732968 requests in 10.10s, 2.13GB read
Requests/sec:  72541.27
Transfer/sec:    215.36MB

Running 10s test @ http://localhost:12345/
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.04ms  542.20us  35.04ms   98.34%
    Req/Sec     9.20k   242.02     9.79k    77.60%
  Latency Distribution
     50%    4.02ms
     75%    4.14ms
     90%    4.23ms
     99%    4.64ms
  739538 requests in 10.11s, 2.14GB read
Requests/sec:  73181.04
Transfer/sec:    217.26MB

Running 10s test @ http://localhost:12345/
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.08ms    1.83ms 121.97ms   99.49%
    Req/Sec     9.21k   404.63    12.38k    91.94%
  Latency Distribution
     50%    4.02ms
     75%    4.14ms
     90%    4.26ms
     99%    4.73ms
  738599 requests in 10.11s, 2.14GB read
Requests/sec:  73082.66
Transfer/sec:    216.97MB

Running 10s test @ http://localhost:12345/
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.10ms    1.33ms  62.82ms   99.29%
    Req/Sec     9.13k   463.20    12.39k    88.09%
  Latency Distribution
     50%    4.05ms
     75%    4.19ms
     90%    4.32ms
     99%    4.83ms
  732322 requests in 10.11s, 2.12GB read
Requests/sec:  72467.84
Transfer/sec:    215.14MB

Running 10s test @ http://localhost:12345/
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.05ms  491.82us  26.90ms   96.88%
    Req/Sec     9.17k   274.18     9.76k    72.38%
  Latency Distribution
     50%    4.03ms
     75%    4.14ms
     90%    4.26ms
     99%    4.78ms
  729907 requests in 10.01s, 2.12GB read
Requests/sec:  72895.86
Transfer/sec:    216.41MB

Running 10s test @ http://localhost:12345/
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.67ms    4.06ms 207.76ms   99.58%
    Req/Sec     9.09k   313.08    11.33k    84.62%
  Latency Distribution
     50%    5.51ms
     75%    5.65ms
     90%    5.80ms
     99%    6.37ms
  723220 requests in 10.02s, 2.10GB read
Requests/sec:  72191.04
Transfer/sec:    214.32MB

Running 10s test @ http://localhost:12345/
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.49ms    1.00ms  54.75ms   97.84%
    Req/Sec     9.15k     1.43k   37.23k    99.13%
  Latency Distribution
     50%    5.50ms
     75%    5.65ms
     90%    5.81ms
     99%    6.38ms
  730506 requests in 10.11s, 2.12GB read
Requests/sec:  72271.50
Transfer/sec:    214.56MB

Running 10s test @ http://localhost:12345/
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.60ms    3.63ms 199.69ms   99.48%
    Req/Sec     9.17k   717.74    18.39k    97.26%
  Latency Distribution
     50%    5.48ms
     75%    5.63ms
     90%    5.76ms
     99%    6.43ms
  733673 requests in 10.11s, 2.13GB read
Requests/sec:  72596.17
Transfer/sec:    215.52MB

Running 10s test @ http://localhost:12345/
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.40ms   12.01ms 363.33ms   98.70%
    Req/Sec     9.06k     2.32k   68.37k    97.00%
  Latency Distribution
     50%    5.47ms
     75%    5.62ms
     90%    5.76ms
     99%   22.68ms
  721996 requests in 10.11s, 2.09GB read
Requests/sec:  71433.83
Transfer/sec:    212.07MB

Running 10s test @ http://localhost:12345/
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.74ms    5.07ms 196.42ms   99.53%
    Req/Sec     9.08k   395.27    12.16k    84.12%
  Latency Distribution
     50%    5.51ms
     75%    5.68ms
     90%    5.85ms
     99%    6.52ms
  728289 requests in 10.11s, 2.11GB read
Requests/sec:  72055.87
Transfer/sec:    213.92MB

Running 10s test @ http://localhost:12345/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.92ms    1.51ms  54.86ms   99.25%
    Req/Sec     9.04k   439.12     9.82k    88.61%
  Latency Distribution
     50%    6.85ms
     75%    7.03ms
     90%    7.24ms
     99%    7.91ms
  726724 requests in 10.11s, 2.11GB read
Requests/sec:  71885.48
Transfer/sec:    213.41MB

Running 10s test @ http://localhost:12345/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.52ms   35.78ms 721.39ms   98.48%
    Req/Sec     9.11k     2.20k   69.62k    98.50%
  Latency Distribution
     50%    6.82ms
     75%    7.01ms
     90%    7.21ms
     99%  159.58ms
  726558 requests in 10.11s, 2.11GB read
Requests/sec:  71886.18
Transfer/sec:    213.41MB

Running 10s test @ http://localhost:12345/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.90ms    1.60ms 105.72ms   98.93%
    Req/Sec     9.07k   330.02     9.81k    79.62%
  Latency Distribution
     50%    6.83ms
     75%    7.00ms
     90%    7.20ms
     99%    7.88ms
  722185 requests in 10.01s, 2.09GB read
Requests/sec:  72117.98
Transfer/sec:    214.10MB

Running 10s test @ http://localhost:12345/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.39ms   10.49ms 332.95ms   99.33%
    Req/Sec     9.13k   331.68    10.73k    87.88%
  Latency Distribution
     50%    6.79ms
     75%    6.96ms
     90%    7.10ms
     99%    7.90ms
  726838 requests in 10.01s, 2.11GB read
Requests/sec:  72614.03
Transfer/sec:    215.58MB

Running 10s test @ http://localhost:12345/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.88ms    2.86ms 187.17ms   99.28%
    Req/Sec     9.15k   322.81     9.75k    92.25%
  Latency Distribution
     50%    6.78ms
     75%    6.95ms
     90%    7.09ms
     99%    7.71ms
  728402 requests in 10.01s, 2.11GB read
Requests/sec:  72750.20
Transfer/sec:    215.98MB

Running 10s test @ http://localhost:12345/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.43ms    4.50ms 152.05ms   98.24%
    Req/Sec     8.75k     0.87k   10.65k    94.62%
  Latency Distribution
     50%   14.18ms
     75%   14.52ms
     90%   14.96ms
     99%   16.84ms
  696266 requests in 10.02s, 2.02GB read
Requests/sec:  69491.40
Transfer/sec:    206.31MB

Running 10s test @ http://localhost:12345/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.79ms    7.90ms 269.14ms   98.36%
    Req/Sec     8.76k   668.86    10.79k    94.50%
  Latency Distribution
     50%   14.18ms
     75%   14.53ms
     90%   14.92ms
     99%   35.08ms
  697264 requests in 10.02s, 2.02GB read
Requests/sec:  69578.34
Transfer/sec:    206.56MB

Running 10s test @ http://localhost:12345/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.28ms   73.61ms 756.77ms   97.14%
    Req/Sec     8.84k   668.34    11.24k    93.75%
  Latency Distribution
     50%   14.07ms
     75%   14.34ms
     90%   14.67ms
     99%  498.07ms
  703529 requests in 10.03s, 2.04GB read
Requests/sec:  70175.62
Transfer/sec:    208.34MB

Running 10s test @ http://localhost:12345/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.66ms   22.55ms 789.62ms   98.82%
    Req/Sec     8.81k   641.78    10.95k    92.62%
  Latency Distribution
     50%   14.09ms
     75%   14.46ms
     90%   14.85ms
     99%   47.95ms
  701656 requests in 10.02s, 2.03GB read
Requests/sec:  69994.84
Transfer/sec:    207.80MB

Running 10s test @ http://localhost:12345/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.45ms    5.22ms 144.19ms   97.93%
    Req/Sec     8.84k   681.15    11.17k    95.25%
  Latency Distribution
     50%   14.07ms
     75%   14.34ms
     90%   14.68ms
     99%   27.74ms
  703870 requests in 10.02s, 2.04GB read
Requests/sec:  70226.64
Transfer/sec:    208.49MB

Running 10s test @ http://localhost:12345/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.81ms   20.14ms 502.63ms   97.62%
    Req/Sec     8.55k     0.99k   10.25k    94.62%
  Latency Distribution
     50%   28.94ms
     75%   29.35ms
     90%   29.78ms
     99%  117.24ms
  680952 requests in 10.05s, 1.97GB read
Requests/sec:  67732.07
Transfer/sec:    201.08MB

Running 10s test @ http://localhost:12345/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.09ms  175.62ms   3.07s    97.00%
    Req/Sec     8.50k     1.25k   10.85k    92.75%
  Latency Distribution
     50%   28.67ms
     75%   29.20ms
     90%   30.06ms
     99%  911.53ms
  676815 requests in 10.06s, 1.96GB read
Requests/sec:  67249.75
Transfer/sec:    199.65MB

Running 10s test @ http://localhost:12345/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.69ms   34.57ms 731.32ms   97.57%
    Req/Sec     8.51k     1.09k   11.38k    92.68%
  Latency Distribution
     50%   28.96ms
     75%   29.75ms
     90%   30.67ms
     99%  162.50ms
  674661 requests in 10.05s, 1.96GB read
Requests/sec:  67112.76
Transfer/sec:    199.24MB

Running 10s test @ http://localhost:12345/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.35ms  137.37ms   2.84s    98.39%
    Req/Sec     8.52k     1.11k   10.48k    96.75%
  Latency Distribution
     50%   28.87ms
     75%   29.39ms
     90%   30.12ms
     99%  481.22ms
  678183 requests in 10.06s, 1.97GB read
Requests/sec:  67415.47
Transfer/sec:    200.14MB

Running 10s test @ http://localhost:12345/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.27ms  324.91ms   4.43s    97.16%
    Req/Sec     8.53k     0.92k   10.93k    95.33%
  Latency Distribution
     50%   28.91ms
     75%   29.56ms
     90%   30.29ms
     99%    2.01s 
  672385 requests in 10.04s, 1.95GB read
Requests/sec:  66974.24
Transfer/sec:    198.83MB

Running 10s test @ http://localhost:12345/
  8 threads and 3000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   301.84ms    1.10s    9.76s    93.83%
    Req/Sec     8.51k     0.88k   10.86k    92.73%
  Latency Distribution
     50%   32.79ms
     75%   36.41ms
     90%   39.19ms
     99%    6.31s 
  665065 requests in 10.05s, 1.93GB read
Requests/sec:  66183.28
Transfer/sec:    196.48MB

Running 10s test @ http://localhost:12345/
  8 threads and 3000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   288.14ms    1.06s    9.84s    94.35%
    Req/Sec     8.42k     1.48k   11.03k    94.07%
  Latency Distribution
     50%   37.56ms
     75%   39.72ms
     90%   84.15ms
     99%    6.22s 
  664514 requests in 10.06s, 1.93GB read
Requests/sec:  66054.93
Transfer/sec:    196.10MB

Running 10s test @ http://localhost:12345/
  8 threads and 3000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   303.95ms    1.10s    9.88s    94.02%
    Req/Sec     8.55k     1.08k   11.00k    92.60%
  Latency Distribution
     50%   35.12ms
     75%   37.62ms
     90%  123.17ms
     99%    6.36s 
  671080 requests in 10.10s, 1.95GB read
Requests/sec:  66438.72
Transfer/sec:    197.24MB

Running 10s test @ http://localhost:12345/
  8 threads and 3000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   300.03ms    1.10s    9.86s    94.07%
    Req/Sec     8.48k     1.02k   11.27k    92.22%
  Latency Distribution
     50%   36.26ms
     75%   37.94ms
     90%   73.85ms
     99%    6.35s 
  666333 requests in 10.06s, 1.93GB read
Requests/sec:  66212.70
Transfer/sec:    196.57MB

Running 10s test @ http://localhost:12345/
  8 threads and 3000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   296.22ms    1.09s    9.87s    94.08%
    Req/Sec     8.45k     1.28k   10.74k    91.92%
  Latency Distribution
     50%   35.24ms
     75%   38.81ms
     90%   66.38ms
     99%    6.29s 
  667628 requests in 10.07s, 1.94GB read
Requests/sec:  66298.19
Transfer/sec:    196.83MB

Running 10s test @ http://localhost:12345/
  8 threads and 4000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   215.40ms  887.28ms   9.80s    95.89%
    Req/Sec     8.34k     1.28k   10.72k    95.10%
  Latency Distribution
     50%   42.64ms
     75%   44.49ms
     90%   46.43ms
     99%    5.48s 
  644413 requests in 10.08s, 1.87GB read
Requests/sec:  63935.94
Transfer/sec:    189.81MB

Running 10s test @ http://localhost:12345/
  8 threads and 4000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   234.89ms  960.03ms   9.82s    95.23%
    Req/Sec     8.48k     0.98k   10.29k    91.33%
  Latency Distribution
     50%   35.11ms
     75%   38.17ms
     90%   39.82ms
     99%    5.81s 
  663525 requests in 10.09s, 1.92GB read
Requests/sec:  65783.67
Transfer/sec:    195.30MB

Running 10s test @ http://localhost:12345/
  8 threads and 4000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   223.27ms  918.91ms   9.55s    95.39%
    Req/Sec     8.49k     1.04k   10.64k    94.79%
  Latency Distribution
     50%   34.95ms
     75%   37.35ms
     90%   39.32ms
     99%    5.59s 
  649114 requests in 10.08s, 1.88GB read
Requests/sec:  64375.35
Transfer/sec:    191.12MB

Running 10s test @ http://localhost:12345/
  8 threads and 4000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   238.98ms  968.38ms   9.65s    94.99%
    Req/Sec     8.58k     0.99k   10.68k    95.75%
  Latency Distribution
     50%   31.77ms
     75%   34.42ms
     90%   36.57ms
     99%    5.80s 
  662798 requests in 10.10s, 1.92GB read
Requests/sec:  65592.92
Transfer/sec:    194.73MB

Running 10s test @ http://localhost:12345/
  8 threads and 4000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   219.92ms  907.51ms   9.80s    95.72%
    Req/Sec     8.32k     1.19k   10.12k    95.62%
  Latency Distribution
     50%   40.28ms
     75%   42.06ms
     90%   43.99ms
     99%    5.58s 
  642975 requests in 10.09s, 1.86GB read
Requests/sec:  63703.05
Transfer/sec:    189.12MB

Running 10s test @ http://localhost:12345/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   173.35ms  726.88ms   9.72s    96.85%
    Req/Sec     8.26k     1.26k   10.40k    91.58%
  Latency Distribution
     50%   50.61ms
     75%   52.83ms
     90%   54.84ms
     99%    4.49s 
  626536 requests in 10.10s, 1.82GB read
Requests/sec:  62021.10
Transfer/sec:    184.13MB

Running 10s test @ http://localhost:12345/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   177.36ms  767.30ms   9.39s    96.54%
    Req/Sec     8.48k     1.39k   11.71k    84.95%
  Latency Distribution
     50%   39.06ms
     75%   41.23ms
     90%   43.19ms
     99%    4.76s 
  629450 requests in 10.10s, 1.82GB read
Requests/sec:  62326.25
Transfer/sec:    185.03MB

Running 10s test @ http://localhost:12345/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   190.57ms  840.65ms   9.63s    96.13%
    Req/Sec     8.38k     0.97k   10.06k    93.88%
  Latency Distribution
     50%   36.20ms
     75%   37.86ms
     90%   39.78ms
     99%    5.22s 
  641357 requests in 10.03s, 1.86GB read
Requests/sec:  63930.83
Transfer/sec:    189.80MB


Running 10s test @ http://localhost:12345/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   193.76ms  834.20ms   9.71s    96.55%
    Req/Sec     8.28k     1.19k   10.40k    94.21%
  Latency Distribution
     50%   45.82ms
     75%   47.12ms
     90%   48.83ms
     99%    5.23s 
  630671 requests in 10.10s, 1.83GB read
Requests/sec:  62427.73
Transfer/sec:    185.33MB

Running 10s test @ http://localhost:12345/
  8 threads and 6000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   149.25ms  644.58ms   9.52s    97.32%
    Req/Sec     8.06k     1.60k   10.56k    93.41%
  Latency Distribution
     50%   49.39ms
     75%   52.41ms
     90%   54.53ms
     99%    3.86s 
  599364 requests in 10.03s, 1.74GB read
Requests/sec:  59782.14
Transfer/sec:    177.48MB

Running 10s test @ http://localhost:12345/
  8 threads and 6000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   156.32ms  705.16ms   9.32s    97.03%
    Req/Sec     8.35k     1.33k   10.56k    94.29%
  Latency Distribution
     50%   38.02ms
     75%   40.11ms
     90%   42.02ms
     99%    4.36s 
  612747 requests in 10.07s, 1.78GB read
Requests/sec:  60873.45
Transfer/sec:    180.72MB


Running 10s test @ http://localhost:12345/
  8 threads and 6000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   155.46ms  671.42ms   9.56s    97.30%
    Req/Sec     8.26k     1.49k   10.03k    95.24%
  Latency Distribution
     50%   47.58ms
     75%   49.32ms
     90%   50.94ms
     99%    4.08s 
  607591 requests in 10.03s, 1.76GB read
Requests/sec:  60564.53
Transfer/sec:    179.80MB

Running 10s test @ http://localhost:12345/
  8 threads and 6000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   151.27ms  628.07ms   9.53s    97.27%
    Req/Sec     8.26k     1.53k   10.62k    92.22%
  Latency Distribution
     50%   52.92ms
     75%   54.67ms
     90%   56.88ms
     99%    3.69s 
  605947 requests in 10.06s, 1.76GB read
Requests/sec:  60205.63
Transfer/sec:    178.74MB

Running 10s test @ http://localhost:12345/
  8 threads and 7000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   133.34ms  586.63ms   8.99s    97.12%
    Req/Sec     8.06k     1.70k   10.24k    94.80%
  Latency Distribution
     50%   43.08ms
     75%   44.70ms
     90%   46.48ms
     99%    3.40s 
  571356 requests in 10.05s, 1.66GB read
Requests/sec:  56866.33
Transfer/sec:    168.82MB

Running 10s test @ http://localhost:12345/
  8 threads and 7000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   146.17ms  630.89ms   9.44s    96.79%
    Req/Sec     8.04k     1.72k   10.48k    94.17%
  Latency Distribution
     50%   44.16ms
     75%   46.54ms
     90%   48.51ms
     99%    3.70s 
  577104 requests in 10.05s, 1.67GB read
Requests/sec:  57435.37
Transfer/sec:    170.51MB


Running 10s test @ http://localhost:12345/
  8 threads and 7000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   134.17ms  607.00ms   9.19s    97.32%
    Req/Sec     8.08k     1.60k   10.53k    92.92%
  Latency Distribution
     50%   42.32ms
     75%   44.69ms
     90%   46.27ms
     99%    3.56s 
  580465 requests in 10.06s, 1.68GB read
Requests/sec:  57677.46
Transfer/sec:    171.23MB

Running 10s test @ http://localhost:12345/
  8 threads and 7000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   172.94ms  655.73ms   9.43s    96.20%
    Req/Sec     8.15k     1.74k   10.33k    93.90%
  Latency Distribution
     50%   50.14ms
     75%   52.26ms
     90%   54.65ms
     99%    3.52s 
  588441 requests in 10.10s, 1.71GB read
Requests/sec:  58247.90
Transfer/sec:    172.93MB


Running 10s test @ http://localhost:12345/
  8 threads and 8000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   130.20ms  530.40ms   8.93s    96.38%
    Req/Sec     8.06k     1.84k   11.03k    92.82%
  Latency Distribution
     50%   46.05ms
     75%   47.86ms
     90%   49.96ms
     99%    2.71s 
  559156 requests in 10.04s, 1.62GB read
Requests/sec:  55697.08
Transfer/sec:    165.35MB


Running 10s test @ http://localhost:12345/
  8 threads and 8000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   158.81ms  660.50ms   8.97s    96.39%
    Req/Sec     7.99k     1.93k   11.15k    91.24%
  Latency Distribution
     50%   47.07ms
     75%   49.00ms
     90%   52.15ms
     99%    3.87s 
  555078 requests in 10.05s, 1.61GB read
Requests/sec:  55210.84
Transfer/sec:    163.91MB


Running 10s test @ http://localhost:12345/
  8 threads and 9000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   147.74ms  565.37ms   9.19s    95.68%
    Req/Sec     7.84k     2.02k   10.07k    92.79%
  Latency Distribution
     50%   48.96ms
     75%   51.02ms
     90%   54.18ms
     99%    2.75s 
  531156 requests in 10.04s, 1.54GB read
Requests/sec:  52906.47
Transfer/sec:    157.07MB


Running 10s test @ http://localhost:12345/
  8 threads and 9000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   118.84ms  452.83ms   8.55s    96.21%
    Req/Sec     7.88k     1.88k   10.13k    93.67%
  Latency Distribution
     50%   48.50ms
     75%   50.96ms
     90%   53.62ms
     99%    1.73s 
  521933 requests in 10.04s, 1.51GB read
Requests/sec:  51973.66
Transfer/sec:    154.30MB


Running 10s test @ http://localhost:12345/
  8 threads and 9000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   132.01ms  478.62ms   8.60s    95.66%
    Req/Sec     7.79k     2.19k   11.09k    90.21%
  Latency Distribution
     50%   48.80ms
     75%   51.37ms
     90%   53.68ms
     99%    1.88s 
  515764 requests in 10.04s, 1.50GB read
Requests/sec:  51374.87
Transfer/sec:    152.52MB

Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   163.24ms  466.13ms   8.27s    93.64%
    Req/Sec     7.62k     2.52k   10.63k    88.30%
  Latency Distribution
     50%   57.30ms
     75%   58.87ms
     90%   63.24ms
     99%    1.99s 
  475597 requests in 10.08s, 1.38GB read
Requests/sec:  47185.33
Transfer/sec:    140.08MB


Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   163.22ms  460.40ms   8.16s    93.59%
    Req/Sec     7.63k     2.46k   10.28k    89.44%
  Latency Distribution
     50%   57.51ms
     75%   59.65ms
     90%   62.71ms
     99%    2.00s 
  476281 requests in 10.04s, 1.38GB read
Requests/sec:  47444.66
Transfer/sec:    140.85MB

Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   170.33ms  459.33ms   9.05s    93.81%
    Req/Sec     7.34k     3.05k   43.16k    83.93%
  Latency Distribution
     50%   71.06ms
     75%   72.59ms
     90%  230.61ms
     99%    2.11s 
  471254 requests in 10.11s, 1.37GB read
Requests/sec:  46619.52
Transfer/sec:    138.40MB

Running 10s test @ http://localhost:12345/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   124.53ms  469.29ms   8.95s    96.10%
    Req/Sec     7.55k     2.46k   10.38k    87.72%
  Latency Distribution
     50%   49.20ms
     75%   51.53ms
     90%   55.24ms
     99%    1.73s 
  515286 requests in 10.03s, 1.49GB read
Requests/sec:  51392.85
Transfer/sec:    152.57MB